tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "kudobuilder/tap"
# Official Amazon AWS command-line interface
brew "awscli"
# Cross-platform make
brew "cmake"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Command-line fuzzy finder written in Go
brew "fzf"
# Improved top (interactive process viewer)
brew "htop"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# International Ispell
brew "ispell"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# Utility for directing compilation
brew "make"
# Platform built on V8 to build network applications
brew "node"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Interact with KUDO via the kubectl plugin
brew "kudobuilder/tap/kudo-cli"
cask "1password"
cask "alfred"
cask "font-ibm-plex"
cask "font-source-code-pro"
cask "google-chrome"
cask "iterm2"
cask "kap"
cask "slack"
cask "vlc"
cask "transmission"
cask "nordvpn"
cask "plex"
cask "whatsapp"
cask "zoomus"
cask "obs"
cask "macdown"
cask "ledger-live"
